In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame({'name'    : ['김씨','이유진', '박동현', '김민지'],
                   'english' : [10,80,60,70],
                   'math'    : [5,60,100,20]})
df

  name  english  math
0   김씨       10     5
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [5]:
df['english']

0    10
1    80
2    60
3    70
Name: english, dtype: int64

In [7]:
sum(df['english'])

220

In [8]:
sum(df['math'])

185

In [9]:
sum(df['english']) / 4 #영어 점수 평균

55.0

In [10]:
sum(df['math']) / 4

46.25

In [11]:
p = pd.DataFrame({'제품'    : ['사과','딸기', '수박'],
                   '가격' : [1800,1500,3000],
                   '판매량'    : [24,38,13]})
p

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [12]:
p['제품']

0    사과
1    딸기
2    수박
Name: 제품, dtype: object

In [14]:
sum(p['가격'])

6300

In [16]:
sum(p['판매량'])

75

In [17]:
sum(p['가격']) / 4

1575.0

In [19]:
sum(p['판매량']) / 4

18.75

In [37]:
df_exam = pd.read_excel('./excel_exam.xlsx')
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [41]:
sum(df_exam['english']) / 20

84.9

In [43]:
sum(df_exam['science']) / 20

59.45

In [45]:
# 변수의 값 개수 구하기
x = [1,2,3,4,5]
x

[1, 2, 3, 4, 5]

In [47]:
len(x)

5

In [49]:
# 데이터 프레임의 행 개수 구하기
df = pd.DataFrame({'a' : [1,2,3],
                   'b': [4,5,6]})
df

   a  b
0  1  4
1  2  5
2  3  6

In [51]:
len(df)

3

In [53]:
# english 합계를 행 개수로 나누기
sum(df_exam['english']) / len(df_exam)

84.9

In [56]:
# science 합계를 행 개수로 나누기
sum(df_exam['science']) / len(df_exam)

59.45

In [67]:
df_exam = pd.read_excel('./excel_exam_novar.xlsx')
df_exam

   1  1.1  50  98  50.1
0  2    1  60  97    60
1  3    2  25  80    65
2  4    2  50  89    98
3  5    3  20  98    15
4  6    3  50  98    45
5  7    4  46  98    65
6  8    4  48  87    12

In [62]:
df_exam_novar = pd.read_excel('excel_exam_novar.xlsx', header=None)
df_exam_novar

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15
5  6  3  50  98  45
6  7  4  46  98  65
7  8  4  48  87  12

In [70]:
df_csv_exam = pd.read_csv('exam.csv')
df_csv_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [75]:
df_midterm = pd.DataFrame({'english'    : ['90','80', '60', '70'],
                   'math' : [50,60,100,20],
                   'nclass'    : [1,1,2,2]})
df_midterm

  english  math  nclass
0      90    50       1
1      80    60       1
2      60   100       2
3      70    20       2

In [79]:
df_midterm.to_csv('output_newdata.csv')

In [81]:
df_midterm.to_csv('output_newdata.csv', index=False)

In [82]:
# 1. 데이터 프레임 만들기
df = pd.DataFrame({'name'    : ['김씨','이유진', '박동현', '김민지'],
                   'english' : [10,80,60,70],
                   'math'    : [5,60,100,20]})
# 2. 외부 데이터 이용하기

# 엑셀 파일 불러오기
df_exam = pd.read_excel('excel_exam.xlsx')
# csv 파일 불러오기
df_csv_exam = pd.read_csv('exam.csv')
# csv 파일로 저장하기
df_midterm.to_csv('output_newdata.csv')